<template>
  <div class="wrapper-about card-c p-4">
    <div class="row">
      <div class="col-12 col-md-6 col-xl-8">
        <Slider />
      </div>
      <div class="col-12 col-md-6 col-xl-4 h-100">
        <div class="card-b">
          <h3 class="title-sub mb-4">Описание</h3>
          <p>Первый компьютерный клуб с домашней атмосферой</p>
          <p>
            Наши мощные игровые компьютеры позволят Вам комфортно играть в самые
            требовательные игры, а атмосфера не оставит вас равнодушными
          </p>
          <div class="card-c d-flex justify-content-center align-items-center fire-wrapper cursor-pointer">
            <div class="operting-mode me-2">Работаем круглосуточно!</div>
            <div class="icon-fire" v-html="svgFire">
              
            </div>
          </div>
        </div>
      </div>
        <div class="col-12 col-md-12 col-xl-12 mt-5">
            <div class="row">
                <div class="col-12 col-md-6 col-xl-4 mt-4">
                    <div class="card-e about-item">
                        <div class="icon-about">
                            <img src="../assets/images/about-one.png" alt="">
                        </div>
                        <div class="title-about">
                            <h2>
                                Цена - качество
                            </h2>
                        </div>
                        <div class="subtitle-about">
                            Наш компьютерный клуб отличается лучшим сочетанием цены и качества на рынке. Мы предлагаем высокие стандарты обслуживания, современное оборудование, комфортные условия и доступные цены для всех наших клиентов.
                        </div>
                    </div>
                </div>
                <div class="col-12 col-md-6 col-xl-4 mt-4">
                    <div class="card-e about-item">
                        <div class="icon-about">
                            <img src="../assets/images/about-two.png" alt="">
                        </div>
                        <div class="title-about">
                            <h2>
                                Местоположение
                            </h2>
                        </div>
                        <div class="subtitle-about">
                            Клуб удобно расположен в самом центре города, что делает нас идеальным местом для проведения времени в любое время суток.
                        </div>
                    </div>
                </div>
                <div class="col-12 col-md-6 col-xl-4 mt-4">
                    <div class="card-e about-item">
                        <div class="icon-about">
                            <img src="../assets/images/about-three.png" alt="">
                        </div>
                        <div class="title-about">
                            <h2>
                                Атмосфера
                            </h2>
                        </div>
                        <div class="subtitle-about">
                            Мы заботимся о вашем комфорте и удовлетворении, поэтому мы оснастили наш клуб современными и качественными компьютерами, мониторами и периферийными устройствами.
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
  </div>
</template>

<script>
import Slider from "./Slider.vue";

export default {
  name: "AreaWD-project",
  data() {
    return {
      svgFire: `
        <svg width="30" height="40" viewBox="0 0 30 40" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g clip-path="url(#clip0_4_175)">
        <path d="M30 25.7625C30 33.625 23.2812 40 15 40C6.71875 40 0 33.625 0 25.7625C0 17.3688 9.8625 4.71253 13.5938 0.23128C13.6725 0.122141 13.7843 0.0413272 13.9127 0.00085666C14.041 -0.0396139 14.179 -0.0375794 14.3061 0.00665735C14.4332 0.0508941 14.5426 0.13497 14.6181 0.246383C14.6936 0.357796 14.7311 0.490595 14.725 0.62503C14.4062 4.37503 14.625 12.4 21.3375 16.4C21.4718 16.491 21.6362 16.5263 21.796 16.4983C21.9558 16.4703 22.0984 16.3813 22.1937 16.25C23.0351 15.0106 23.5214 13.5647 23.6 12.0688C23.6073 11.9314 23.6598 11.8003 23.7492 11.6957C23.8387 11.5912 23.9601 11.5191 24.0947 11.4906C24.2293 11.4621 24.3696 11.4788 24.4937 11.5381C24.6178 11.5975 24.7189 11.6961 24.7812 11.8188C27.6375 16.5188 30 21.65 30 25.7625Z" fill="#FF7F00"/>
        <path d="M5.625 31.1C5.625 36.0187 9.825 40 15 40C20.175 40 24.375 36.0187 24.375 31.1C24.375 26.1812 18.9438 18.9062 16.35 15.7187C16.2723 15.6066 16.1601 15.5231 16.0304 15.4807C15.9007 15.4384 15.7608 15.4396 15.6319 15.4842C15.503 15.5288 15.3923 15.6144 15.3166 15.7278C15.2408 15.8412 15.2043 15.9763 15.2125 16.1125C15.3063 18.6125 14.8687 22.8437 11.2437 25.1437C11.1733 25.1904 11.0942 25.2222 11.0111 25.2374C10.928 25.2526 10.8427 25.2508 10.7604 25.2321C10.678 25.2134 10.6003 25.1782 10.5319 25.1287C10.4635 25.0791 10.4059 25.0162 10.3625 24.9437C10.0474 24.4042 9.83551 23.8108 9.7375 23.1937C9.72324 23.0579 9.6649 22.9305 9.5714 22.831C9.47789 22.7315 9.35437 22.6654 9.21972 22.6427C9.08506 22.62 8.94669 22.642 8.82575 22.7054C8.70481 22.7688 8.60795 22.8701 8.55 22.9937C6.90625 25.7625 5.625 28.7062 5.625 31.1Z" fill="#FFDA00"/>
        <path d="M20.1562 35.1063C20.1425 35.7673 19.9979 36.419 19.7306 37.0237C19.4634 37.6284 19.0789 38.1741 18.5993 38.6292C18.1198 39.0843 17.5548 39.4398 16.937 39.6751C16.3191 39.9104 15.6608 40.0209 15 40.0001C14.3392 40.0209 13.6809 39.9104 13.063 39.6751C12.4452 39.4398 11.8802 39.0843 11.4007 38.6292C10.9211 38.1741 10.5366 37.6284 10.2694 37.0237C10.0021 36.419 9.85747 35.7673 9.84375 35.1063C9.84375 32.6876 12.2188 29.2501 13.75 27.2876C13.8248 27.1801 13.9313 27.0989 14.0547 27.0553C14.1781 27.0116 14.3121 27.0079 14.4378 27.0445C14.5634 27.0811 14.6744 27.1562 14.7551 27.2592C14.8358 27.3623 14.8821 27.488 14.8875 27.6188C14.8899 28.3801 15.059 29.1315 15.3829 29.8204C15.7069 30.5093 16.1778 31.1189 16.7625 31.6063C16.8389 31.6721 16.9301 31.7184 17.0283 31.7413C17.1264 31.7642 17.2287 31.763 17.3263 31.7379C17.424 31.7127 17.514 31.6643 17.5889 31.5968C17.6638 31.5292 17.7212 31.4446 17.7562 31.3501C17.7936 31.2323 17.8649 31.1283 17.9613 31.0511C18.0577 30.9739 18.1748 30.927 18.2979 30.9163C18.4209 30.9056 18.5444 30.9316 18.6526 30.991C18.7609 31.0504 18.8492 31.1405 18.9062 31.2501C19.6176 32.4206 20.0456 33.7411 20.1562 35.1063Z" fill="white"/>
        </g>
        <defs>
        <clipPath id="clip0_4_175">
        <rect width="30" height="40" fill="white"/>
        </clipPath>
        </defs>
        </svg>

        `,
    };
  },
  components: {
    Slider,
  },
};
</script>

<style scoped></style>
